Amiya200/stm32_water_tank/Core/Src/model_handle.c
// Handle Dry Run logic within the motor control protections
static void dry_run_protection(void) {
    if (motorStatus == 1U) {  // If the motor is running
        if (!senseDryRun) {
            // Dry condition detected, start the timer if not already armed
            if (!dryTimerArmed) {
                dryTimerArmed = true;
                dryStopDeadline = HAL_GetTick() + DRY_STOP_DELAY_SECONDS * 1000U;  // Delay in ms
            } else if (HAL_GetTick() >= dryStopDeadline) {
                // If the dry condition persists beyond the delay, stop the motor
                ModelHandle_StopAllModesAndMotor();
                printf("Motor stopped due to dry condition.\n");
            }
        } else {
            // If water is detected, cancel the dry run timer
            dryTimerArmed = false;
            dryStopDeadline = 0;
        }
    } else {
        // If the motor is off, reset the dry run timer
        dryTimerArmed = false;
        dryStopDeadline = 0;
    }
}

// Function to call periodically to process dry run checks and pro




static inline bool dry_raw_is_dry(void)
{
//    float v = adcData.voltages[0];
//    if (DRY_ACTIVE_LOW) return (v < DRY_THRESHOLD_V);
//    else                return (v > DRY_THRESHOLD_V);
}

/* =========================
   Manual Mode
   ========================= */
void ModelHandle_ToggleManual(void)
{
    // toggling manual should dominate and clear other modes
    bool will_on = !manualActive;

    if (will_on) {
        clear_all_modes();
        manualOverride = true;
        manualActive   = true;
        start_motor();
        //printf("Manual ON\r\n");
    } else {
        ModelHandle_StopAllModesAndMotor(); // OFF should clear everything
        //printf("Manual OFF\r\n");
    }
    ModelHandle_SaveCurrentStateToEEPROM();
}

void ModelHandle_ManualLongPress(void)
{
    //printf("Manual Long Press → System Reset\r\n");
    HAL_Delay(100);
    NVIC_SystemReset();
}

/* ============================================================
   COUNTDOWN MODE
   ============================================================ */
volatile uint16_t countdownRemainingRuns = 0;

static uint32_t cd_deadline_ms      = 0;
static uint32_t cd_rest_deadline_ms = 0;
static uint32_t cd_run_seconds      = 0;
static bool     cd_in_rest          = false;
static const uint32_t CD_REST_MS    = 3000;

void ModelHandle_StopCountdown(void)
{
    stop_motor_keep_modes();
    countdownActive        = false;
    countdownMode          = false;
    countdownRemainingRuns = 0;
    cd_run_seconds         = 0;
    cd_in_rest             = false;
    countdownDuration      = 0;
}
static void countdown_start_one_run(void)
{
    cd_deadline_ms    = now_ms() + (cd_run_seconds * 1000UL);
    countdownDuration = cd_run_seconds;
    cd_in_rest        = false;
    start_motor();
}
void ModelHandle_StartCountdown(uint32_t seconds_per_run, uint16_t repeats)
{
    if (seconds_per_run == 0 || repeats == 0) {
        ModelHandle_StopCountdown();
        return;
    }

    clear_all_modes();
    countdownMode          = true;
    countdownActive        = true;
    cd_run_seconds         = seconds_per_run;
    countdownRemainingRuns = repeats;
    cd_in_rest             = false;

    countdown_start_one_run();
    ModelHandle_SaveCurrentStateToEEPROM();
}
static void countdown_tick(void)
{
    if (!countdownActive) return;
    uint32_t now = now_ms();

    if (cd_in_rest) {
        if ((int32_t)(cd_rest_deadline_ms - now) <= 0) {
            if (countdownRemainingRuns > 0) {
                countdown_start_one_run();
            } else {
                ModelHandle_StopCountdown();
            }
        }
        return;
    }

    if ((int32_t)(cd_deadline_ms - now) > 0) {
        uint32_t rem_ms = cd_deadline_ms - now;
        countdownDuration = (rem_ms + 999U) / 1000U;

        if (isTankFull()) {
            ModelHandle_StopAllModesAndMotor(); // terminal condition -> clear all modes
        }
        return;
    }

    stop_motor_keep_modes();
    if (countdownRemainingRuns > 0) countdownRemainingRuns--;
    if (countdownRemainingRuns == 0) {
        ModelHandle_StopCountdown();
        return;
    }

    cd_in_rest          = true;
    cd_rest_deadline_ms = now + CD_REST_MS;
    countdownDuration   = 0;
}

/* =======================
   TWIST MODE
   ======================= */
static bool     twist_on_phase       = false;
static uint32_t twist_phase_deadline = 0;
/* DRY counter must not accumulate while motor is OFF */
static uint8_t  twist_dry_cnt        = 0;
static bool     twist_priming        = false;
static uint32_t twist_prime_deadline = 0;

/* Count DRY only while motor is ON to avoid latch-off after first OFF */
static inline bool isDryLowSupply_debounced(void)
{
//    if (!Motor_GetStatus()) {
//        // If motor is OFF, do not count; keep counter at 0
//        twist_dry_cnt = 0;
//        return false;
//    }
//
//    bool raw = dry_raw_is_dry();
//    if (raw) {
//        if (twist_dry_cnt < 255) twist_dry_cnt++;
//    } else {
//        twist_dry_cnt = 0;
//    }
//    return (twist_dry_cnt >= 3);
}
static inline void twist_arm_priming(void)
{
    if (TWIST_PRIME_SECONDS > 0) {
        twist_priming        = true;
        twist_prime_deadline = now_ms() + (uint32_t)TWIST_PRIME_SECONDS * 1000UL;
    } else {
        twist_priming        = false;
        twist_prime_deadline = 0;
    }
}

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s)
{
    clear_all_modes();
    if (on_s == 0)  on_s  = 1;
    if (off_s == 0) off_s = 1;

    twistSettings.onDurationSeconds  = on_s;
    twistSettings.offDurationSeconds = off_s;
    twistSettings.twistActive  = true;
    twistActive                = true;
    twist_on_phase       = false;
    twist_phase_deadline = now_ms() + (uint32_t)twistSettings.offDurationSeconds * 1000UL;
    twist_dry_cnt        = 0;
    // Do NOT arm priming here; it's armed when ON actually starts.

    twist_arm_priming();
    ModelHandle_SaveCurrentStateToEEPROM();
}

void ModelHandle_StopTwist(void)
{
    twistSettings.twistActive = false;
    twistActive = false;
    twist_priming  = false;
    twist_dry_cnt  = 0;
    stop_motor_keep_modes();
}
// Call this from your main scheduler at ~10–100ms rate
// Call ~every 10–100 ms from your main loop/scheduler
void twist_tick(void)
{
    // 0) Inert unless explicitly enabled by the user
    if (!twistSettings.twistActive) {
        // Defensive: never force motor here—other modes own it.
        return;
    }

