Amiya200/stm32_water_tank/Core/Src/model_handle.c
    uint32_t tnow = now_ms();

    // 1) Global safety gates (if your project uses these flags)
    //    If any protection is latched, keep Twist "enabled" but stop driving the motor.
    if (senseOverLoad || senseOverUnderVolt || senseMaxRunReached) {
        stop_motor_keep_modes();   // do not clear modes; just stop motor output
        return;
    }

    // 2) Priming window logic:
    //    When we first enter an ON phase we allow a short "prime" even if the sensor reads dry,
    //    to build initial pressure. This DOES NOT move the phase deadline.
    if (twist_priming) {
        if ((int32_t)(twist_prime_deadline - tnow) > 0) {
            if (!Motor_GetStatus()) start_motor();   // stay ON during priming
            return;                                  // do not touch phase deadline
        } else {
            twist_priming = false;                   // priming finished
        }
    }

    // 3) While in ON phase, you may optionally gate on "dry" (if your design wants this).
    //    We DON’T toggle the motor from ADC elsewhere; we only *observe* a dry flag here.
    //    If you don’t want dry handling in Twist, you can remove this block.
//#if defined(DRY_STOP_DELAY_SECONDS) && (DRY_STOP_DELAY_SECONDS > 0)
//    if (twist_on_phase) {
//        // If a dry condition is being signaled by the sensing layer, count it.
//        if (senseDryRun) {
//            if (twist_dry_cnt < 0xFF) twist_dry_cnt++;
//        } else {
//            twist_dry_cnt = 0;
//        }
//
//        // If dry persisted long enough, end the ON phase early and jump to OFF.
//        if (twist_dry_cnt >= (uint8_t)DRY_STOP_DELAY_SECONDS) {
//            stop_motor_keep_modes();
//            twist_on_phase       = false;
//            twist_dry_cnt        = 0;
//            twist_phase_deadline = tnow + (uint32_t)twistSettings.offDurationSeconds * 1000UL;
//            return;
//        }
//    }
//#endif
//
    // 4) Phase timing: flip when deadline elapses (signed compare prevents wrap issues).
    if ((int32_t)(twist_phase_deadline - tnow) <= 0) {
        twist_on_phase = !twist_on_phase;

        if (twist_on_phase) {
            // Entering ON phase
            twist_dry_cnt        = 0;
            start_motor();
            twist_phase_deadline = tnow + (uint32_t)twistSettings.onDurationSeconds * 1000UL;

            // Arm priming exactly when ON begins (once per ON phase).
#if defined(TWIST_PRIME_SECONDS) && (TWIST_PRIME_SECONDS > 0)
            twist_priming        = true;
            twist_prime_deadline = tnow + (uint32_t)TWIST_PRIME_SECONDS * 1000UL;
#endif
        } else {
            // Entering OFF phase
            stop_motor_keep_modes();
            twist_dry_cnt        = 0;
            twist_phase_deadline = tnow + (uint32_t)twistSettings.offDurationSeconds * 1000UL;
        }
    } else {
        // 5) Maintain current phase outputs until the deadline arrives
        if (twist_on_phase) {
            if (!Motor_GetStatus()) start_motor();
        } else {
            if (Motor_GetStatus())  stop_motor_keep_modes();
        }
    }
}

/* =======================
   SEARCH MODE
   ======================= */
typedef enum {
    SEARCH_GAP_WAIT = 0,
    SEARCH_PROBE,
    SEARCH_RUN
} SearchState;

static SearchState search_state = SEARCH_GAP_WAIT;
static uint32_t    search_deadline_ms = 0;
static uint8_t     search_dry_cnt = 0;

void ModelHandle_StartSearch(uint16_t gap_s, uint16_t probe_s)
{
    clear_all_modes();

    if (gap_s   == 0) gap_s   = 5;
    if (probe_s == 0) probe_s = 3;

    searchSettings.testingGapSeconds = gap_s;
    searchSettings.dryRunTimeSeconds = probe_s;

    searchSettings.searchActive = true;
    searchActive = true;

    stop_motor_keep_modes();
    search_state       = SEARCH_GAP_WAIT;
    search_deadline_ms = now_ms() + (uint32_t)searchSettings.testingGapSeconds * 1000UL;
    search_dry_cnt     = 0;
    ModelHandle_SaveCurrentStateToEEPROM();
}
void ModelHandle_StopSearch(void)
{
    searchSettings.searchActive = false;
    searchActive = false;
    search_state = SEARCH_GAP_WAIT;
    stop_motor_keep_modes();
}
static inline bool isDryDebounced_RUN(void)
{
    if (dry_raw_is_dry()) {
        if (search_dry_cnt < 255) search_dry_cnt++;
    } else {
        search_dry_cnt = 0;
    }
    return (search_dry_cnt >= 3);
}
static void search_tick(void)
{
    if (!searchSettings.searchActive) { searchActive = false; return; }
    searchActive = true;

    uint32_t nowt = now_ms();

    if (isTankFull()) {
        ModelHandle_StopAllModesAndMotor();
        return;
    }

    switch (search_state)
    {
        case SEARCH_GAP_WAIT:
            if (Motor_GetStatus()) stop_motor_keep_modes();
            if ((int32_t)(search_deadline_ms - nowt) <= 0) {
                start_motor(); // probe ON
                search_state       = SEARCH_PROBE;
                search_deadline_ms = nowt + (uint32_t)searchSettings.dryRunTimeSeconds * 1000UL;
                search_dry_cnt     = 0;
            }
            break;

        case SEARCH_PROBE:
            if (!dry_raw_is_dry()) {
                // Water detected → RUN
                search_state       = SEARCH_RUN;
                search_deadline_ms = 0;
                search_dry_cnt     = 0;
                break;
            }
            if ((int32_t)(search_deadline_ms - nowt) <= 0) {
                // Still dry after probe
                stop_motor_keep_modes();
                search_state       = SEARCH_GAP_WAIT;
                search_deadline_ms = nowt + (uint32_t)searchSettings.testingGapSeconds * 1000UL;
            }
            break;

        case SEARCH_RUN:
            if (isDryDebounced_RUN()) {
                ModelHandle_StopAllModesAndMotor(); // terminal dry -> clear modes
                break;
            }
            if (!Motor_GetStatus()) start_motor(); // keep asserted
            break;
    }
}

/* =======================
   TIMER (RTC based)
   ======================= */


void ModelHandle_SetTimerSlot(uint8_t i,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM,
                              bool en)
{
    if (i < 5)
    {
        timerSlots[i].enabled = en;
        timerSlots[i].onHour = onH;
        timerSlots[i].onMinute = onM;
        timerSlots[i].offHour = offH;
        timerSlots[i].offMinute = offM;
    }
}

void ModelHandle_ProcessTimerSlots(void)
{
    RTC_GetTimeDate();  // update 'time' from RTC

