Amiya200/stm32_water_tank/Core/Src/model_handle.c
    uint16_t nowM = time.hour * 60 + time.minutes;
    bool motorShouldRun = false;

    for (uint8_t i = 0; i < 5; i++)
    {
        if (!timerSlots[i].enabled)
            continue;

        uint16_t onM  = timerSlots[i].onHour * 60 + timerSlots[i].onMinute;
        uint16_t offM = timerSlots[i].offHour * 60 + timerSlots[i].offMinute;

        if (onM < offM)
        {
            if (nowM >= onM && nowM < offM)
                motorShouldRun = true;
        }
        else  // handle midnight wrap-around (e.g., 23:00 → 02:00)
        {
            if (nowM >= onM || nowM < offM)
                motorShouldRun = true;
        }
    }

    ModelHandle_SetMotor(motorShouldRun);
}

static uint32_t seconds_since_midnight(void)
{
    RTC_GetTimeDate();
    return ((uint32_t)time.hour * 3600UL) +
           ((uint32_t)time.minutes * 60UL) +
           (uint32_t)time.seconds;
}
/* =========================
   TIMER MODE
   ========================= */
void timer_tick(void)
{
    if (!timerActive) return;

    RTC_GetTimeDate();
    uint32_t nowSec = ModelHandle_TimeToSeconds(time.hour, time.minutes);

    bool shouldRun = false;
    for (int i = 0; i < 5; i++) {
        if (!timerSlots[i].enabled) continue;

        uint32_t onSec  = ModelHandle_TimeToSeconds(timerSlots[i].onHour,  timerSlots[i].onMinute);
        uint32_t offSec = ModelHandle_TimeToSeconds(timerSlots[i].offHour, timerSlots[i].offMinute);

        if (onSec < offSec) {
            if (nowSec >= onSec && nowSec < offSec) shouldRun = true;
        } else { // overnight slot (e.g. 23:00–05:00)
            if (nowSec >= onSec || nowSec < offSec) shouldRun = true;
        }
    }

    if (shouldRun && !Motor_GetStatus()) {
        start_motor();
    } else if (!shouldRun && Motor_GetStatus()) {
        stop_motor_keep_modes();
    }
}
void ModelHandle_StartTimer(void) {
    clear_all_modes();
    timerActive = true;
    ModelHandle_SaveCurrentStateToEEPROM();
}

void ModelHandle_StopTimer(void) {
    timerActive = false;
    stop_motor_keep_modes();
}


/* =======================
   SEMI-AUTO
   ======================= */
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;

    if (!isTankFull()) {
        start_motor();
        //printf("Semi-Auto Started\r\n");
    } else {
        ModelHandle_StopAllModesAndMotor();
        //printf("Semi-Auto Not Started: Already Full\r\n");
    }
    ModelHandle_SaveCurrentStateToEEPROM();
}
void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive   = false;
    ModelHandle_StopAllModesAndMotor();
    //printf("Semi-Auto Stopped\r\n");
}
static void semi_auto_tick(void)
{
    if (!semiAutoActive) return;

    // Only complete on full; keep asserting motor otherwise
    if (isTankFull()) {
        semiAutoActive = false;
        ModelHandle_StopAllModesAndMotor();
        //printf("Semi-Auto Complete: Tank Full\r\n");
        return;
    }

    // Keep motor ON during semi-auto (protections may still cut it)
    if (!Motor_GetStatus()) start_motor();
}

/* =======================
   PROTECTIONS
   ======================= */
static void protections_tick(void)
{
    /* Manual override → only hard protections */
    if (manualOverride && manualActive) {
        if (senseOverLoad && motorStatus == 1U) ModelHandle_StopAllModesAndMotor();
        if (senseOverUnderVolt) ModelHandle_StopAllModesAndMotor();
        if (maxRunTimerArmed && (now_ms() - maxRunStartTick) >= MAX_CONT_RUN_MS) {
            ModelHandle_StopAllModesAndMotor();
            senseMaxRunReached = true;
        }
        return;
    }

    /* DRY-RUN: delayed stop */
//    if (motorStatus == 1U) {
//        if (dry_raw_is_dry()) {
//            senseDryRun = true; // show on UI while counting
//            if (!dryTimerArmed) {
//                dryTimerArmed   = true;
//                dryStopDeadline = now_ms() + (uint32_t)DRY_STOP_DELAY_SECONDS * 1000UL;
//            } else {
//                if ((int32_t)(dryStopDeadline - now_ms()) <= 0) {
//                    ModelHandle_StopAllModesAndMotor();
//                    // Keep flag true until user action clears (or water returns and motor restarts)
//                }
//            }
//        } else {
//            // water found => cancel dry timer & flag
//            dryTimerArmed   = false;
//            dryStopDeadline = 0;
//            senseDryRun     = false;
//        }
//    } else {
//        // motor is off; reset dry timing
//        dryTimerArmed   = false;
//        dryStopDeadline = 0;
//        // keep senseDryRun as-is for UI; it will clear on next water detection
//    }

    /* Other protections -> hard clear */
    if (senseOverLoad && motorStatus == 1U) ModelHandle_StopAllModesAndMotor();
    if (senseOverUnderVolt) ModelHandle_StopAllModesAndMotor();

    if (maxRunTimerArmed && (now_ms() - maxRunStartTick) >= MAX_CONT_RUN_MS) {
        ModelHandle_StopAllModesAndMotor();
        senseMaxRunReached = true;
    }
}

/* =======================
   LEDs
   ======================= */
static void leds_from_model(void)
{
    LED_ClearAllIntents();

    if (motorStatus == 1U) {
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);
    }
    if (countdownActive) {
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 500);
    }
    if (senseDryRun) {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
    }
    if (senseMaxRunReached) {
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 400);
    }
    if (senseOverLoad) {
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    }
    if (senseOverUnderVolt) {
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    }

    LED_ApplyIntents();
}

/* =======================
   Public Motor APIs
   ======================= */
void ModelHandle_SetMotor(bool on)
{
    if (on) {
        clear_all_modes();         // turning ON directly should not have stray modes
        manualOverride = true;
        start_motor();
    } else {
        ModelHandle_StopAllModesAndMotor();
    }
}
void ModelHandle_ClearManualOverride(void) { manualOverride = false; }
bool Motor_GetStatus(void) { return (motorStatus == 1U); }

/* =======================
   Main pump
   ======================= */
void ModelHandle_Process(void)
{
	dry_run_protection();
    /* keep your original order of tickers */
	if (twistActive)    twist_tick();
	if (countdownActive) countdown_tick();
	if (searchActive)   search_tick();
	if (timerActive)    timer_tick();   // ✅ add this
    semi_auto_tick();

    /* --- Aux Burst auto-OFF (Relays 2 & 3) --- */
    if (auxBurstActive) {
        uint32_t nowt = HAL_GetTick();
        if ((int32_t)(auxBurstDeadlineMs - nowt) <= 0) {
            Relay_Set(2, false);
            Relay_Set(3, false);
            auxBurstActive = false;
        }
    }

    protections_tick();
    leds_from_model();
}

/* =======================
   UART commands
   ======================= */
void ModelHandle_ProcessUartCommand(const char* cmd)
{
    if (!cmd || !*cmd) return;

