Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if      (strcmp(cmd, "MOTOR_ON") == 0)  { ModelHandle_SetMotor(true); } //printf("Manual ON (UART)\r\n"); }
    else if (strcmp(cmd, "MOTOR_OFF")== 0)  { ModelHandle_SetMotor(false);} //printf("Manual OFF (UART)\r\n"); }
    else if (strcmp(cmd, "SEMI_AUTO_START")==0) { ModelHandle_StartSemiAuto(); }
    else if (strcmp(cmd, "SEMI_AUTO_STOP")==0)  { ModelHandle_StopSemiAuto(); }
    else if (strcmp(cmd, "TWIST_START")==0)     { ModelHandle_StartTwist(twistSettings.onDurationSeconds, twistSettings.offDurationSeconds); }
    else if (strcmp(cmd, "TWIST_STOP")==0)      { ModelHandle_StopTwist(); }
    else if (strcmp(cmd, "SEARCH_START")==0)    { ModelHandle_StartSearch(searchSettings.testingGapSeconds, searchSettings.dryRunTimeSeconds); }
    else if (strcmp(cmd, "SEARCH_STOP")==0)     { ModelHandle_StopSearch(); }
    else if (strcmp(cmd, "RESET_ALL")==0)       { ModelHandle_ResetAll(); }
}
// --- Lightweight persistent save ---
// ⚙️ Requires: RTC_SavePersistentState() from rtc_i2c.c
// ⚙️ Safe for 24C32 / 24C02 EEPROM (4-Kbit+)

void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    static uint32_t lastWriteTick = 0;
    static uint8_t  lastCRC = 0;        // 1-byte change fingerprint
    uint32_t now = HAL_GetTick();

    // 🧭 Limit writes: once every 15 s
    if (now - lastWriteTick < 15000U)
        return;

    // 🧱 Allocate statically once (no stack each call)
    static RTC_PersistState s;

    // Manual zeroing (tiny, no memset())
    for (uint16_t i = 0; i < sizeof(s); i++)
        ((uint8_t*)&s)[i] = 0;

    // === Minimal state capture ===
    if (manualActive)        s.mode = 1;
    else if (semiAutoActive) s.mode = 2;
    else if (timerActive)    s.mode = 3;
    else if (searchActive)   s.mode = 4;
    else if (countdownActive)s.mode = 5;
    else if (twistActive)    s.mode = 6;
    else                     s.mode = 0;

    s.motor        = Motor_GetStatus();
    s.searchGap    = searchSettings.testingGapSeconds;
    s.searchProbe  = searchSettings.dryRunTimeSeconds;
    s.twistOn      = twistSettings.onDurationSeconds;
    s.twistOff     = twistSettings.offDurationSeconds;
    s.countdownMin = (uint16_t)(countdownDuration / 60U);
    s.countdownRep = 1U;

    // ⚙️ Copy only first timer slot (8–10 B)
    extern TimerSlot timerSlots[5];
    for (uint8_t i = 0; i < sizeof(TimerSlot); i++)
        ((uint8_t*)&s.timerSlots[0])[i] = ((uint8_t*)&timerSlots[0])[i];

    // === Compact 8-bit CRC-like fingerprint for quick diff ===
    uint8_t crc = 0;
    const uint8_t *p = (const uint8_t*)&s;
    for (uint16_t i = 0; i < sizeof(s) - 2; i++)
        crc ^= p[i];

    // Write only if changed since last save
    if (crc != lastCRC)
    {
        RTC_SavePersistentState(&s);  // actual I2C write
        lastCRC = crc;
        lastWriteTick = now;
    }
}
